{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "model/pi/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "model/pi/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/pi_fc1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/pi_fc1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/pi_fc0/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/pi_fc0/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "input/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input/Ob", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "12"}]}}}}, {"name": "input/split", "op": "Split", "input": ["input/split/split_dim", "input/Ob"], "attr": {"T": {"type": "DT_INT32"}, "num_split": {"i": "12"}}}, {"name": "input/one_hot_11", "op": "OneHot", "input": ["input/split:11", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_10", "op": "OneHot", "input": ["input/split:10", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_9", "op": "OneHot", "input": ["input/split:9", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_8", "op": "OneHot", "input": ["input/split:8", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_7", "op": "OneHot", "input": ["input/split:7", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_6", "op": "OneHot", "input": ["input/split:6", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_5", "op": "OneHot", "input": ["input/split:5", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_4", "op": "OneHot", "input": ["input/split:4", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_3", "op": "OneHot", "input": ["input/split:3", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_2", "op": "OneHot", "input": ["input/split:2", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot_1", "op": "OneHot", "input": ["input/split:1", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/one_hot", "op": "OneHot", "input": ["input/split", "input/one_hot/depth", "input/one_hot/on_value", "input/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "input/concat", "op": "ConcatV2", "input": ["input/one_hot", "input/one_hot_1", "input/one_hot_2", "input/one_hot_3", "input/one_hot_4", "input/one_hot_5", "input/one_hot_6", "input/one_hot_7", "input/one_hot_8", "input/one_hot_9", "input/one_hot_10", "input/one_hot_11", "input/split/split_dim"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "12"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model/flatten/Shape", "op": "Shape", "input": ["input/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "model/flatten/strided_slice", "op": "StridedSlice", "input": ["model/flatten/Shape", "model/flatten/strided_slice/stack", "model/flatten/strided_slice/stack_1", "model/flatten/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "model/flatten/Reshape/shape", "op": "Pack", "input": ["model/flatten/strided_slice", "input/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "model/flatten/Reshape", "op": "Reshape", "input": ["input/concat", "model/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/pi_fc0/MatMul", "op": "MatMul", "input": ["model/flatten/Reshape", "model/pi_fc0/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "model/pi_fc0/add", "op": "Add", "input": ["model/pi_fc0/MatMul", "model/pi_fc0/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Tanh", "op": "Tanh", "input": ["model/pi_fc0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/pi_fc1/MatMul", "op": "MatMul", "input": ["model/Tanh", "model/pi_fc1/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "model/pi_fc1/add", "op": "Add", "input": ["model/pi_fc1/MatMul", "model/pi_fc1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/Tanh_2", "op": "Tanh", "input": ["model/pi_fc1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/pi/MatMul", "op": "MatMul", "input": ["model/Tanh_2", "model/pi/w"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "model/pi/add", "op": "Add", "input": ["model/pi/MatMul", "model/pi/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/Softmax", "op": "Softmax", "input": ["model/pi/add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "model/pi/b", "shape": [4], "dtype": "float32"}, {"name": "model/pi/w", "shape": [64, 4], "dtype": "float32"}, {"name": "model/pi_fc1/b", "shape": [64], "dtype": "float32"}, {"name": "model/pi_fc1/w", "shape": [64, 64], "dtype": "float32"}, {"name": "model/pi_fc0/b", "shape": [64], "dtype": "float32"}, {"name": "model/pi_fc0/w", "shape": [24, 64], "dtype": "float32"}, {"name": "input/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "model/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "model/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "input/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "input/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "input/one_hot/depth", "shape": [], "dtype": "int32"}]}]}